//Здійснити циклічний зсув елементів квадратної матриці розмірності MxN вправо на
//k елементів таким чином : елементи 1 - го рядка зсуваються в останній стовпець зверху вниз, з
//нього - в останній рядок справа наліво, з нього - в перший стовпець знизу вгору, з нього - в
//перший рядок; для інших елементів - аналогічно.

#include <iostream>

using namespace std;

int main() {
	int n;
	int** mas;

	cout << "Input size for the square matrix" << endl;
	cin >> n;

	mas = new int* [n];
	for (i = 0; i < n; i++) {
		mas[i] = new int[n];
	}


};
