//В одновимірному масиві який складається із N дійсних елементів, розрахувати:
//кількість елементів масиву, більших за С; добуток елементів масиву, які знаходяться за
//максимальним по модулю елементом.Перетворити масив таким чином, щоб спочатку
//розташовувалися всі від’ємні елементи, а потім – всі додатні(елементи, рівні 0, вважати
//    додатними).

#include <iostream>
#include "Header.h"

using namespace std;

int main()
{
    int mas[N];
    INPUTMAS(mas, N);
    OUTMAS(mas, N);
    COUNTBIGGER(mas, N, C);
    COUNTAFTERUMAX(mas, N);
    SORTMAS(mas, N);
    OUTMAS(mas, N);
    return 0;
}
